IDEA StatiCa Open Model
LineSupportSegment.FlexibleStiffnessX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Support stiffness X dirrection
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double FlexibleStiffnessX { get; set; }
Public Property FlexibleStiffnessX As Double
	Get
	Set
public:
property double FlexibleStiffnessX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
LineSupportSegment Class
IdeaRS.OpenModel.Model Namespace